alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F004_UINT32_0_to_FP32_check_0_a.c
/*----------------------------------------------------------------------------
*
* The confidential and proprietary information contained in this file may
* only be used by a person authorised under and to the extent permitted
* by a subsisting licensing agreement from ARM Limited.
*
*        (C) COPYRIGHT 2008-2009 ARM Limited.
*             ALL RIGHTS RESERVED
*             
* This entire notice must be reproduced on all copies of this file
* and copies of this file may only be made by a person if such person is
* permitted to do so under the terms of a subsisting license agreement
* from ARM Limited.
*
* Modified  : $Date: 2013/05/14 11:57:51 $
* Revision  : $Revision: 1.1 $
* Release   : $State: Exp $
*-----------------------------------------------------------------------------*/
#include "m400_gp_F004_UINT32_0_to_FP32_check_0_a.h"
struct t_CheckData_m400_gp_F004_UINT32_0_to_FP32_check_0_a __attribute__ ((section(".mali_data_check"))) CheckData_m400_gp_F004_UINT32_0_to_FP32_check_0_a = {
/* unsigned int data_00002000[] = */
{
 0x00000000,0x3f800000,0x40000000,0x40400000 /* 00002000 */
,0x40800000,0x40a00000,0x40c00000,0x40e00000 /* 00002010 */
,0x41000000,0x41100000,0x41200000,0x41300000 /* 00002020 */
,0x41400000,0x41500000,0x41600000,0x41700000 /* 00002030 */
,0x41800000,0x41880000,0x41900000,0x41980000 /* 00002040 */
,0x41a00000,0x41a80000,0x41b00000,0x41b80000 /* 00002050 */
,0x41c00000,0x41c80000,0x41d00000,0x41d80000 /* 00002060 */
,0x41e00000,0x41e80000,0x41f00000,0x41f80000 /* 00002070 */
,0x41700000,0x43700000,0x45700000,0x47700000 /* 00002080 */
,0x49700000,0x4b700000,0x4d700000,0x4f700000 /* 00002090 */
,0x4effffff,0x4f000000,0x4f000000,0x4f000000 /* 000020a0 */
,0x4f7ffffc,0x4f7ffffc,0x4f7ffffc,0x4f7ffffc /* 000020b0 */
,0x4f7ffffd,0x4f7ffffd,0x4f7ffffd,0x4f7ffffd /* 000020c0 */
,0x4f7ffffe,0x4f7ffffe,0x4f7ffffe,0x4f7ffffe /* 000020d0 */
,0x4f7fffff,0x4f7fffff,0x4f7fffff,0x4f7fffff /* 000020e0 */
,0x4f7fffff,0x4f7fffff,0x4f7fffff,0x4f7fffff /* 000020f0 */
},
};
